namespace IMO2017P2

open Function

/-
IMO 2017 Problem 2

Find all f : ℝ → ℝ such that

  f (f x * f y) + f (x + y) = f (x * y)

for all x, y ∈ ℝ.
-/

def Good (f : ℝ → ℝ) : Prop :=
  ∀ x y : ℝ,
    f (f x * f y) + f (x + y) = f (x * y)


/- ============================================================
   Candidate solutions
   ============================================================ -/

namespace Good

variable {f : ℝ → ℝ}


/- ============================================================
   Negating a solution
   ============================================================ -/

end Good


/- ============================================================
   FINAL CLASSIFICATION
   ============================================================ -/
